{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "d5a65e71",
   "metadata": {},
   "source": [
    "Если в нашей модели есть количественные предикторы, то в интерцепте мы будем иметь значение, соответствующее базовому уровню категориальных предикторов и нулевому уровню количественных. Это не всегда осмысленно. Например, нам не интересен прогноз для людей нулевого возраста или роста. В таких ситуациях количественную переменную имеет смысл предварительно центрировать так, чтобы ноль являлся средним значением переменной. Самый простой способ центрировать переменную — отнять от каждого наблюдения среднее значение всех наблюдений.\n",
    "\n",
    "xcenteredi = xi − xˉ\n",
    "  \n",
    "\n",
    "В этом задании вашей задачей будет  написать функцию centered, которая получает на вход датафрейм и имена переменных, которые необходимо центрировать так, как это описано выше. Функция должна возвращать этот же датафрейм, только с центрированными указанными переменными.\n",
    "\n",
    "Пример работы функции:\n",
    "\n",
    "> test_data <- read.csv(\"https://stepic.org/media/attachments/course/524/cen_data.csv\")\n",
    "\n",
    "> test_data\n",
    "\n",
    "   X1   X2   X3   X4\n",
    "    \n",
    "1  8.5  9.7 10.7 10.3\n",
    "\n",
    "2  8.1 12.8  9.7 12.6\n",
    "\n",
    "3  9.6  7.4  8.4 12.7\n",
    "\n",
    "4  9.6 10.9  7.7  8.0\n",
    "\n",
    "5 11.9 13.7 12.3 11.0﻿\n",
    "\n",
    "> var_names = c(\"X4\", \"X2\", \"X1\")\n",
    " \n",
    "> centered(test_data, var_names)\n",
    "\n",
    "   X1   X2   X3    X4\n",
    "     \n",
    "1 -1.04 -1.2 10.7 -0.62\n",
    "\n",
    "2 -1.44  1.9  9.7  1.68\n",
    "\n",
    "3  0.06 -3.5  8.4  1.78\n",
    "\n",
    "4  0.06  0.0  7.7 -2.92\n",
    "\n",
    "5  2.36  2.8 12.3  0.08"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "afad47ce",
   "metadata": {},
   "outputs": [],
   "source": [
    "centered <- function(test_data, var_names){\n",
    "means <- colMeans(test_data[var_names])\n",
    " transp <- t(t(test_data[var_names])-means)\n",
    " test_data[var_names] <- transp\n",
    " return(test_data)\n",
    "}"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "R",
   "language": "R",
   "name": "ir"
  },
  "language_info": {
   "codemirror_mode": "r",
   "file_extension": ".r",
   "mimetype": "text/x-r-source",
   "name": "R",
   "pygments_lexer": "r",
   "version": "3.6.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
