{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "4059d310",
   "metadata": {},
   "source": [
    "Задачка на программирование.\n",
    "\n",
    "В R мы без труда можем рассчитать среднее и медиану вектора, а вот встроенной функции для расчета моды — наиболее часто встречаемого значения — в R нет! А мода так бы пригодилась нам при анализе номинативных данных! При этом функция mode в R существует, но выполняет абсолютно другую задачу (если хотите узнать, какую именно, ознакомьтесь со справкой: наберите в консоли ?mode).\n",
    "\n",
    "Напишите функцию stat_mode, которая получает на вход вектор из чисел произвольной длины и возвращает числовой вектор с наиболее часто встречаемым значением. Если наиболее часто встречаемых значений несколько, функция должна возвращать несколько значений моды  в виде числового вектора. \n",
    "\n",
    "> v <- c(1, 2, 3, 3, 3, 4, 5)\n",
    "\n",
    "> stat_mode(v)\n",
    "\n",
    "[1] 3\n",
    "\n",
    "> v <- c(1, 1, 1, 2, 3, 3, 3)\n",
    "\n",
    "> stat_mode(v)\n",
    "\n",
    "[1] 1 3"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "3b6036cf",
   "metadata": {},
   "outputs": [],
   "source": [
    "stat_mode <- function(x){\n",
    "  tablo <- table(x)\n",
    "  return(as.numeric(names(tablo[tablo == max(tablo)])))\n",
    "}"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "R",
   "language": "R",
   "name": "ir"
  },
  "language_info": {
   "codemirror_mode": "r",
   "file_extension": ".r",
   "mimetype": "text/x-r-source",
   "name": "R",
   "pygments_lexer": "r",
   "version": "3.6.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
