{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "39dddeea",
   "metadata": {},
   "source": [
    "Напишите функцию smart_test, которая получает на вход dataframe с двумя номинативными переменными с произвольным числом градаций. Функция должна проверять гипотезу о независимости этих двух переменных при помощи критерия хи - квадрат или точного критерия Фишера.\n",
    "\n",
    "Если хотя бы в одной ячейке таблицы сопряженности двух переменных меньше 5 наблюдений, функция должна рассчитывать точный критерий Фишера и возвращать вектор из одного элемента: получившегося p - уровня значимости.\n",
    "\n",
    "Если наблюдений достаточно для расчета хи-квадрат (во всех ячейках больше либо равно 5 наблюдений), тогда функция должна применять критерий хи-квадрат и возвращать вектор из трех элементов: значение хи-квадрат, число степеней свободы,  p-уровня значимости.\n",
    "\n",
    "Примеры работы функции:\n",
    "\n",
    "#Достаточно наблюдений в таблице\n",
    "\n",
    "> table(mtcars[,c(\"am\", \"vs\")])\n",
    "\n",
    "   vs\n",
    "   \n",
    "am   0  1\n",
    "\n",
    "  0 12  7\n",
    "  \n",
    "  1  6  7\n",
    "  \n",
    "> smart_test(mtcars[,c(\"am\", \"vs\")])\n",
    "\n",
    "[1] 0.3475355 1.0000000 0.5555115\n",
    "\n",
    "\n",
    "#Недостаточно наблюдений в таблице\n",
    "\n",
    "> table(mtcars[1:20,c(\"am\", \"vs\")])\n",
    "\n",
    "   vs\n",
    "   \n",
    "am  0 1\n",
    "\n",
    "  0 8 6\n",
    "  \n",
    "  1 2 4\n",
    "  \n",
    "> smart_test(mtcars[1:20,c(\"am\", \"vs\")])\n",
    "\n",
    "[1] 0.628483"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "f9c842af",
   "metadata": {},
   "outputs": [],
   "source": [
    "smart_test <-  function(x){\n",
    "  t <- table(x)\n",
    "  if (min(t) >= 5){\n",
    "    chi <- chisq.test(t)\n",
    "    print(c(chi$statistic, chi$parameter, chi$p.value))\n",
    "  }else {\n",
    "    fisher.test(t)[1]\n",
    "  }\n",
    "}"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "R",
   "language": "R",
   "name": "ir"
  },
  "language_info": {
   "codemirror_mode": "r",
   "file_extension": ".r",
   "mimetype": "text/x-r-source",
   "name": "R",
   "pygments_lexer": "r",
   "version": "3.6.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
